package com.application.kgtuapp.AbstractClasses

abstract class AbstractController() {
    //пока не знаю насколько в этом есть смысл, по идее мы имеем на данный момент
    // 4 основных фрагмента: расписание, календарь, универ и профиль. В каждом из них должно
    // отображаться определенное количество виджетов, поэтому имеет смысл использовать такой
    // абстрактный класс и затем от него брать наследников для того, чтобы унифицировать
    // работу контроллеров на разных экранах (просто переопределяя метод createMarkup).

    open fun createMarkup(){

    }
}